tools/common/VMRestSso.Common/RestSsoAdminSnapIn.Service/xml/SAMLRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">  <soapenv:Header>    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">      <wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">        <wsu:Created>{0}</wsu:Created>        <wsu:Expires>{1}</wsu:Expires>      </wsu:Timestamp>      <wsse:UsernameToken xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">        <wsse:Username>{2}</wsse:Username>        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">{3}</wsse:Password>      </wsse:UsernameToken>    </wsse:Security>  </soapenv:Header>  <soapenv:Body xmlns:wst="http://docs.oasis-open.org/ws-sx/ws-trust/200512">    <wst:RequestSecurityToken xmlns:wst="http://docs.oasis-open.org/ws-sx/ws-trust/200512">      <wst:TokenType>urn:oasis:names:tc:SAML:2.0:assertion</wst:TokenType>      <wst:RequestType>http://docs.oasis-open.org/ws-sx/ws-trust/200512/Issue</wst:RequestType>      <wst:KeyType>http://docs.oasis-open.org/ws-sx/ws-trust/200512/Bearer</wst:KeyType>      <wst:Lifetime xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">        <wsu:Created>{4}</wsu:Created>        <wsu:Expires>{5}</wsu:Expires>      </wst:Lifetime>      <wst:Renewing Allow="false" OK="false"/>      <wst:Delegatable>false</wst:Delegatable>    </wst:RequestSecurityToken>  </soapenv:Body></soapenv:Envelope>