vmidentity/sts/src/test/resources/request/invalid_confirmation_type.xml

<?xml version='1.0' encoding='UTF-8'?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header><ns5:Security xmlns="http://docs.oasis-open.org/ws-sx/ws-trust/200512" xmlns:ns2="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:ns3="http://www.rsa.com/names/2009/12/std-ext/WS-Trust1.4/advice" xmlns:ns4="http://www.w3.org/2005/08/addressing" xmlns:ns5="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><ns2:Timestamp ns2:Id="_96efe77b-7f75-475b-8799-3437e4bf9de4"><ns2:Created>2012-05-15T16:44:46.871Z</ns2:Created><ns2:Expires>2012-05-15T16:54:46.871Z</ns2:Expires></ns2:Timestamp><saml2:Assertion xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:ns2="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:ns3="http://docs.oasis-open.org/ws-sx/ws-trust/200512" xmlns:ns4="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:ns5="http://www.w3.org/2000/09/xmldsig#" xmlns:ns6="http://www.rsa.com/names/2009/12/std-ext/SAML2.0" xmlns:ns7="http://www.w3.org/2005/08/addressing" xmlns:ns8="urn:oasis:names:tc:SAML:2.0:conditions:delegation" xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" ID="_3d3ea80d-aaab-4e6b-a42a-4c6c22fd5575" IssueInstant="2012-05-15T16:44:28.757Z" Version="2.0"><saml2:Issuer Format="urn:oasis:names:tc:SAML:2.0:nameid-format:entity">csp.com/sts</saml2:Issuer><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><ds:SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#rsa-sha256"/><ds:Reference URI="#_3d3ea80d-aaab-4e6b-a42a-4c6c22fd5575"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="xs xsi"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/><ds:DigestValue>xyQIX21Q4v7lS4cEEColZMcidU+7TiTu6IkNwqrRliU=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>aiVDxU5GsS5b9vKvtHpzRforO3uecT4AaC45v1ZkNKIMdo3WyBJeipORF2MUJ8NSDx3VDKbrcqwT
8uhKt0kwGSVggxIf09qqFtafyfwSfrQOB8f64GAxdDf5lt6K7aDwGX8uCeYMK3pYEeFJMEabn64E
zuSFt/XMfjjZGsoCW6S2i2od6hrzBjacuHK3M7wCWi/iJs6cqI3eA4nFzUtaxteOCpz+84zlTh+x
vRmVqo6wkZlbyvkgIgaByjmtz7wJewcdnp+imosL7Cs84+a+N1jZ1vmgfxdHiaoLqlocNnDhIO1Y
H31dbW3W2gSTMtnfJ8KPyBJ19F9zYvzmXpN+zA==</ds:SignatureValue><ds:KeyInfo><ds:X509Data><ds:X509Certificate>MIIDMTCCAhkCCQCpraeAXt4HqDANBgkqhkiG9w0BAQUFADBaMQwwCgYDVQQDDANzdHMxDDAKBgNV
BAsMA1ImRDEPMA0GA1UECgwGVk13YXJlMQ4wDAYDVQQHDAVTb2ZpYTEOMAwGA1UECAwFU29maWEx
CzAJBgNVBAYTAkJHMB4XDTEyMDExMDEwMDYzN1oXDTIxMTAwOTEwMDYzN1owWzENMAsGA1UEAwwE
c3RzMTEMMAoGA1UECwwDUiZEMQ8wDQYDVQQKDAZWTVdhcmUxDjAMBgNVBAcMBVNvZmlhMQ4wDAYD
VQQIDAVTb2ZpYTELMAkGA1UEBhMCQkcwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQDE
GyhRK1ygL5QibjTrVdpRvSHTaGhskOVLKK4xnoRub9TbI2j1zGgxa7T9oQ6R86Ofg/kvOm+Fzhb8
Jt5shCUKzSweQ2bGa5yjt0kO/FbwE7oxOdV/3XuJbn7fd+xdwdpT+5pFKKjYgdKJmoV3FZEoiB+l
if/IvX0f5pfJHPbUHIiKRIukzdSmg/sfyH4gczw8r67jC51jmD7djZPQ3ySlR59erXr/en3g5hWF
3Szn0p/5EPSCfT6p1UFBDKW28AqD8tLXajN13tOUw1/guSTPmhJfn+nM+6oH2/bjHoPe1B/wGlEh
uAPuuzHpyhxcJ1nMGWJhZPkIQmS0EwKousAPAgMBAAEwDQYJKoZIhvcNAQEFBQADggEBAJHLw/Hh
lxx6KOIflq9W9goav/uGzEGtiKzfFGSZKV3oCcL597Csj669p/02INNg+AzZRo5i2Sjsa3QIuxWp
pee3TmfOb6fKBVTO90UIQddHOeWNOZIGN1zfzpbIuetNfr9vICxhFZo3Y+7MH58mnXUQ4UU2WV3y
m91fcJhyxuYx1lH+fPbbKuJGatOxO6Yj/DEcGcJ6ZuMG+lsgiM2EKy6jPbvnhw/hvv+jzasBmU9h
gBk3tytSE4m0tIMupBVWA5f2JSVZOdJkJSZaYygpnkBYZPpmSQGKwmPcADb2QzpB40yCCK04WLzk
aD6mx9REtLxX+CTzgqNn9Yy9YxIwdwY=</ds:X509Certificate><ds:X509Certificate>MIIDMDCCAhgCCQDpq2xOc2VT+DANBgkqhkiG9w0BAQUFADBaMQwwCgYDVQQDDANzdHMxDDAKBgNV
BAsMA1ImRDEPMA0GA1UECgwGVk13YXJlMQ4wDAYDVQQHDAVTb2ZpYTEOMAwGA1UECAwFU29maWEx
CzAJBgNVBAYTAkJHMB4XDTEyMDExMDEwMDA1MFoXDTIyMDEwNzEwMDA1MFowWjEMMAoGA1UEAwwD
c3RzMQwwCgYDVQQLDANSJkQxDzANBgNVBAoMBlZNd2FyZTEOMAwGA1UEBwwFU29maWExDjAMBgNV
BAgMBVNvZmlhMQswCQYDVQQGEwJCRzCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBALDm
uj6862nk/Vge3Khf/cps2W6W7rimia4hl2muWqVwJk7zpNb1fo4X6Gu3dNwEt2GvwS2crbklcH4M
yquQnM7PoNIRBo5eyLtXPXA4KnUlJgaZj11VOYk2046/ftiIK3a5dI2Z6LI2QNVYMzAwSPEXoEui
szvgysG8h9RXFTqABXqX4pALT+J7hOaqXk15uohIgsFWz6IsaWcuTkcLRG0WG21h57ApL+IZ38XV
RsDKdTFOUQPV36lk6rzNmQ8usLYidgOs6Kry79/r0tzHhRVLGne51AbK9qnkUOny6cDuat93thri
vASaRHBiANMa1RCn17Gijunu4aMlAMmbgX0CAwEAATANBgkqhkiG9w0BAQUFAAOCAQEANFXCY8F6
UBN5MOSIJq52fTfNAwicsozLb6309245WFfIYl9grUjQj7axBWIaSW+XoHcKrSDgSDh3Ds7ikmfF
DIQVVkLmfmx/2TjhOoDzphtmyyDsgWI0dwH0iDtKV2KRueQITts3cjqk5pd88g8Kmg09/HEDSx5T
XIMfamCxjvcKCLdnYDGYT6iDzMwsxgWqOs/wMihyTmpUtYUfjQlw1VEzBUGaZmOkxaLXj+WCdanP
uyGzKH8NWy43SSXPbYfhhqP2tvvQ5vg8BCUu8xsDikMD8pRC480KQT7ONEBtJNcfnAHeLAVtxOyP
ab3Hq/zePyznZRd5EN3b8N1l18ibvA==</ds:X509Certificate></ds:X509Data></ds:KeyInfo></ds:Signature><saml2:Subject><saml2:NameID Format="http://schemas.xmlsoap.org/claims/UPN">administrator@csp.com</saml2:NameID><saml2:SubjectConfirmation Method="urn:oasis:names:tc:SAML:2.0:cm:bearer"><saml2:SubjectConfirmationData xsi:type="saml2:KeyInfoConfirmationDataType"><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:X509Data><ds:X509Certificate>MIIDRjCCAi6gAwIBAgIGATdRYv8aMA0GCSqGSIb3DQEBCwUAMFsxCzAJBgNVBAYTAkJHMQ4wDAYD
VQQIEwVTb2ZpYTEOMAwGA1UEBxMFU29maWExDzANBgNVBAoTBlZNd2FyZTEMMAoGA1UECwwDUiZE
MQ0wCwYDVQQDEwRVc2VyMB4XDTEyMDUxNTE2NDQyN1oXDTEyMDUxNTE3MDQyN1owWzELMAkGA1UE
BhMCQkcxDjAMBgNVBAgTBVNvZmlhMQ4wDAYDVQQHEwVTb2ZpYTEPMA0GA1UEChMGVk13YXJlMQww
CgYDVQQLDANSJkQxDTALBgNVBAMTBFVzZXIwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIB
AQCF5vQPLusEFwy4TT4Xcm1Fy80f/IV0U4ylAZYbf4ZiUqe141W3WJ9lMT/YHs3dMQZ9bQCNNU1s
kQOtW6ZlZE8Zu6CksDobD+xR8LVhFwt2ZGe3T3mvbtoPZGrGpuhHjXsByRW8TB7DkIQMJ2QtbkvI
Rks5KL8djgWuQexMaz7nzOM+BWc8aX2XAaE6m8TU/8axlpUm5bKO+/qPGxddD+snEQV6i1IyDxNz
Dy6clpSB6YdO2RFGZoqJfMYkGT87UUIGuSrkdNRUs4UFlpo7uOEdUO0O9DZED3jvd/EhozcJFbOA
qtNBZ41PLS0dDr1oEvwPWvD0tdPowxMUMTI1JWLlAgMBAAGjEDAOMAwGA1UdEwEB/wQCMAAwDQYJ
KoZIhvcNAQELBQADggEBADZ24I9CUi7nXhnMOnZStxHOLmJ8RDwsOqZs/E52iNqMbc9WwOfxnWNm
veQr8D/yKt4H6qqw+2PGh/5fkGfeuSka2pcOQ7Nd9riYwrn7yoNWj0eaEBXu7RHr5RgI1GsE7+30
8viY8AaF1nU1WGqzfSdVXgo0ksPsNwPeNV3AKT2+WjBaCUzC0ipdbMGAATF1vsqfYFiTG6jCDsOE
dN6glPEQzhvgr6FzD8s1YsuC6fBvgp/Xx6+1HfeFlbQvetl3GLbOxibzGkYpkwi7RCA2UG90x7y6
js2be5JVogyiSSxajbFd6Xw9AF38zg+S3yNtaWuzEsSiO2lXIdbVC4VfMqg=</ds:X509Certificate></ds:X509Data></ds:KeyInfo></saml2:SubjectConfirmationData></saml2:SubjectConfirmation></saml2:Subject><saml2:Conditions NotBefore="2012-05-15T16:44:45.152Z" NotOnOrAfter="2012-05-15T16:45:45.152Z"><saml2:ProxyRestriction Count="0"/><saml2:Condition xmlns:rsa="http://www.rsa.com/names/2009/12/std-ext/SAML2.0" Count="10" xsi:type="rsa:RenewRestrictionType"/></saml2:Conditions><saml2:AuthnStatement AuthnInstant="2012-05-15T16:44:28.738Z"><saml2:AuthnContext><saml2:AuthnContextClassRef>urn:oasis:names:tc:SAML:2.0:ac:classes:PasswordProtectedTransport</saml2:AuthnContextClassRef></saml2:AuthnContext></saml2:AuthnStatement><saml2:AttributeStatement><saml2:Attribute FriendlyName="surname" Name="http://schemas.xmlsoap.org/ws/2005/05/identity/claims/surname" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri"><saml2:AttributeValue xsi:type="xs:string">csp</saml2:AttributeValue></saml2:Attribute><saml2:Attribute FriendlyName="givenName" Name="http://schemas.xmlsoap.org/ws/2005/05/identity/claims/givenname" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri"><saml2:AttributeValue xsi:type="xs:string">Administrator</saml2:AttributeValue></saml2:Attribute><saml2:Attribute FriendlyName="Groups" Name="http://rsa.com/schemas/attr-names/2009/01/GroupIdentity" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri"><saml2:AttributeValue xsi:type="xs:string">csp.com\Users</saml2:AttributeValue><saml2:AttributeValue xsi:type="xs:string">csp.com\Administrators</saml2:AttributeValue></saml2:Attribute><saml2:Attribute FriendlyName="Subject Type" Name="http://vmware.com/schemas/attr-names/2011/07/isSolution" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri"><saml2:AttributeValue xsi:type="xs:string">false</saml2:AttributeValue></saml2:Attribute></saml2:AttributeStatement></saml2:Assertion><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><ds:SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#rsa-sha512"/><ds:Reference URI="#_41f0a5cd-aafd-41a3-8a90-73481ad340e5"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha512"/><ds:DigestValue>LGSXPT5yueUFZWH+JTAiB84SyCJu56359tNqoLW0Y5SLKuqEtlCYSilC5fW6xBPbZgmHDGqQRmxs
xMIu7nCF8A==</ds:DigestValue></ds:Reference><ds:Reference URI="#_96efe77b-7f75-475b-8799-3437e4bf9de4"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha512"/><ds:DigestValue>IR9QUFbq4vEq6y/RGSSMYRTX4z0PXD+XNdJdOUYbugTPTpshvhi5DTz8LTqZs9DVOXx9PtzzJWYo
ZAoarmHSvw==</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>bLcQOzJVS3I+/ls4nQl8pqC4UZmu1uLb2Z5PONr1GcJ0CnwLPfUO28xwQ4oT399/vHJVR94moaS0
+MK4KlTVQ+BSO3KOavkF9QXJzyg57T0Ll2v8Mcv8iJXQCNd4D25ZdRvaFz5F9G9M/H3zkzpbU1yt
ozZeZR37YIvAsXhFlJfoIeaLaboctN1AMdq8C874gkt4WCVr2+eD3Cjx//4qWL0PbyBmo5WyjOjq
VIyZZkZdepioaTaJMyQGocizDbzmWwhSawqGfVwfqPkwvdBzHuesRbO5eRxI/Uz9eqrYlDOgP/QW
5/v2iCw4Bjj8heRKfjNbjXBwR2/cMYPg8iWHcw==</ds:SignatureValue><ds:KeyInfo><ns2:SecurityTokenReference xmlns:ns1="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:ns2="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:ns3="http://docs.oasis-open.org/ws-sx/ws-trust/200512" xmlns:ns4="http://www.rsa.com/names/2009/12/std-ext/WS-Trust1.4/advice" xmlns:ns5="http://www.w3.org/2005/08/addressing" xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd" wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-saml-tokenprofile-1.1#SAMLV2.0"><ns2:KeyIdentifier ValueType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLID">_3d3ea80d-aaab-4e6b-a42a-4c6c22fd5575</ns2:KeyIdentifier></ns2:SecurityTokenReference></ds:KeyInfo></ds:Signature></ns5:Security></SOAP-ENV:Header><SOAP-ENV:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="_41f0a5cd-aafd-41a3-8a90-73481ad340e5"><RequestSecurityToken xmlns="http://docs.oasis-open.org/ws-sx/ws-trust/200512" xmlns:ns2="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:ns3="http://www.rsa.com/names/2009/12/std-ext/WS-Trust1.4/advice" xmlns:ns4="http://www.w3.org/2005/08/addressing" xmlns:ns5="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><TokenType>urn:oasis:names:tc:SAML:2.0:assertion</TokenType><RequestType>http://docs.oasis-open.org/ws-sx/ws-trust/200512/Issue</RequestType><Lifetime><ns2:Created>2012-05-15T16:44:46.871Z</ns2:Created><ns2:Expires>2012-05-15T16:45:46.871Z</ns2:Expires></Lifetime><Renewing Allow="false" OK="false"/><KeyType>http://docs.oasis-open.org/ws-sx/ws-trust/200512/PublicKey</KeyType><SignatureAlgorithm>http://www.w3.org/2001/04/xmldsig-more#rsa-sha256</SignatureAlgorithm></RequestSecurityToken></SOAP-ENV:Body></SOAP-ENV:Envelope>
