tools/common/VMRestSso.Common/RestSsoAdminSnapIn.Service/xml/BETLoginRequest.xml

<?xml version="1.0" encoding="utf-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">  <soapenv:Header>    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">      <wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">        <wsu:Created>{0}</wsu:Created>        <wsu:Expires>{1}</wsu:Expires>      </wsu:Timestamp>    </wsse:Security>  </soapenv:Header>  <soapenv:Body xmlns:wst="http://docs.oasis-open.org/ws-sx/ws-trust/200512">    <wst:RequestSecurityToken Context="urn:uuid:529e77c7-f58c-be76-39bb-83434e1476e0" xmlns:wst="http://docs.oasis-open.org/ws-sx/ws-trust/200512">      <wst:TokenType>urn:oasis:names:tc:SAML:2.0:assertion</wst:TokenType>      <wst:RequestType>http://docs.oasis-open.org/ws-sx/ws-trust/200512/Issue</wst:RequestType>      <wst:KeyType>http://docs.oasis-open.org/ws-sx/ws-trust/200512/Bearer</wst:KeyType>      <wst:Lifetime xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">        <wsu:Created>{2}</wsu:Created>        <wsu:Expires>{3}</wsu:Expires>      </wst:Lifetime>      <wst:Renewing Allow="false" OK="false"/>      <wst:Delegatable>false</wst:Delegatable>      <wst:BinaryExchange EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://schemas.xmlsoap.org/ws/2005/02/trust/spnego">{4}</wst:BinaryExchange>    </wst:RequestSecurityToken>  </soapenv:Body></soapenv:Envelope>